#### Dataset for rental houses inÂ nairobi

In [2]:
import pandas as pd

In [3]:
file_path = "data/apartments.csv"

df = pd.read_csv(file_path)

df.head()

,Unnamed: 0,title,location,bedrooms,bathrooms,price,rate
0,0,3 Bedroom Apartment / Flat to rent in Riverside,"Riverside Dr Nairobi, Riverside, Nairobi",3,3,200 000,Per Month
1,1,3 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",3,4,70 000,Per Month
2,2,3 Bedroom Apartment / Flat to rent in Nyali,"Links Rd Mombasa, Nyali, Mombasa",3,2,38 000,Per Month
3,3,3 Bedroom Apartment / Flat to rent in Lavington,"Near Valley Arcade, Lavington, Nairobi",3,3,80 000,Per Month
4,4,1 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",1,1,110 000,Per Month

#### Data preprocessing

###### drop first coloumn

In [4]:
df = df.drop(df.columns[0], axis=1)

df.head()

,title,location,bedrooms,bathrooms,price,rate
0,3 Bedroom Apartment / Flat to rent in Riverside,"Riverside Dr Nairobi, Riverside, Nairobi",3,3,200 000,Per Month
1,3 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",3,4,70 000,Per Month
2,3 Bedroom Apartment / Flat to rent in Nyali,"Links Rd Mombasa, Nyali, Mombasa",3,2,38 000,Per Month
3,3 Bedroom Apartment / Flat to rent in Lavington,"Near Valley Arcade, Lavington, Nairobi",3,3,80 000,Per Month
4,1 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",1,1,110 000,Per Month

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2520 entries, 0 to 2519
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      2520 non-null   object
 1   location   2144 non-null   object
 2   bedrooms   2520 non-null   int64
 3   bathrooms  2520 non-null   int64
 4   price      2520 non-null   object
 5   rate       2520 non-null   object
dtypes: int64(2), object(4)
memory usage: 118.3+ KB

###### drop rate coloumn

In [6]:
df = df.drop('rate', axis=1)

df.head()

,title,location,bedrooms,bathrooms,price
0,3 Bedroom Apartment / Flat to rent in Riverside,"Riverside Dr Nairobi, Riverside, Nairobi",3,3,200 000
1,3 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",3,4,70 000
2,3 Bedroom Apartment / Flat to rent in Nyali,"Links Rd Mombasa, Nyali, Mombasa",3,2,38 000
3,3 Bedroom Apartment / Flat to rent in Lavington,"Near Valley Arcade, Lavington, Nairobi",3,3,80 000
4,1 Bedroom Apartment / Flat to rent in Kileleshwa,"Kileleshwa, Nairobi",1,1,110 000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2520 entries, 0 to 2519
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   title      2520 non-null   object
 1   location   2144 non-null   object
 2   bedrooms   2520 non-null   int64
 3   bathrooms  2520 non-null   int64
 4   price      2520 non-null   object
dtypes: int64(2), object(3)
memory usage: 98.6+ KB

###### check for null values

In [9]:
df.isnull().sum()

title          0
location     376
bedrooms       0
bathrooms      0
price          0
dtype: int64

In [10]:
# Find rows with any null values
null_rows = df[df.isnull().any(axis=1)]

print(null_rows)

                                                 title location  bedrooms  \
7      3 Bedroom Apartment / Flat to rent in Westlands      NaN         3
15    2 Bedroom Apartment / Flat to rent in Hurlingham      NaN         2
18         3 Bedroom Apartment / Flat to rent in Nyali      NaN         3
29     3 Bedroom Apartment / Flat to rent in Westlands      NaN         3
36    2 Bedroom Apartment / Flat to rent in Hurlingham      NaN         2
...                                                ...      ...       ...
2493  2 Bedroom Apartment / Flat to rent in Hurlingham      NaN         2
2496       3 Bedroom Apartment / Flat to rent in Nyali      NaN         3
2506   3 Bedroom Apartment / Flat to rent in Westlands      NaN         3
2513  2 Bedroom Apartment / Flat to rent in Hurlingham      NaN         2
2516       3 Bedroom Apartment / Flat to rent in Nyali      NaN         3

      bathrooms    price
7             3   78 000
15            2   75 000
18            2   45 000
29            3   78 000
36            2   75 000
...         ...      ...
2493          2   75 000
2496          2   45 000
2506          3   78 000
2513          2   75 000
2516          2   45 000

[376 rows x 5 columns]